'use strict';

////////////////////////////////////////////////////////////////////////////
/////////////////////////// Первое задание /////////////////////////////////
////////////////////////////////////////////////////////////////////////////
let a = parseFloat(prompt('Введите число А:')),
	b = parseFloat(prompt('Введите число B:')),
	c = parseFloat(prompt('Введите число C:')),
	max;

if (a > b) {
	if (a > c) {
		max = a;
	} else {
		max = c;
	}
} else if (b > c) {
	max = b;
} else {
	max = c;
}

alert(`A = ${a}, B = ${b}, C = ${c}.\nНаибольшее из чисел: ${max}`);


////////////////////////////////////////////////////////////////////////////
/////////////////////////// Второе задание /////////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let snailSpeed = parseFloat(prompt('Введите скорость улитки: '));

if (snailSpeed > 0) {
	alert('Улитка ползет вперед.');
} else if (snailSpeed < 0) {
	alert('Улитка ползет назад.');	
} else {
	alert('Улитка стоит на месте.');
}
*/

////////////////////////////////////////////////////////////////////////////
/////////////////////////// Третье задание /////////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let myMoney = parseFloat(prompt('Сколько у меня денег?')),
	friendMoney = parseFloat(prompt('Сколько у друга денег?')),
	ourMoney = myMoney + friendMoney;

if (ourMoney < 2000 && ourMoney > 20) {
	alert('Нам хватает разве что на пиво...');
} else if (ourMoney >= 2000) {
	alert('Мы летим на Мальту учить английский язык!');
} else {
	alert('Раз уж нам не хватает даже на пиво, нужно искать работу.');
}
*/

////////////////////////////////////////////////////////////////////////////
///////////////////////////// Четвертое задание ////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let age = parseInt(prompt('Введите возраст человека:'));
if (age >= 20 && age < 30) {
	alert('Выслать повестку.');
}
*/

////////////////////////////////////////////////////////////////////////////
/////////////////////////////// Пятое задание //////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let busNumber = parseInt(prompt('Введите номер приехавшей машрутки:'));
if (busNumber ===  7 || busNumber === 225 || busNumber === 255) {
	alert('Едем домой.');
} else {
	alert('Ждём дальше.');
}
*/

////////////////////////////////////////////////////////////////////////////
////////////////////////////// Шестое задание //////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let day = prompt('Какой сегодня день:');
if (day.toUpperCase() != 'ВОСКРЕСЕНЬЕ' && day.toUpperCase() != 'СУББОТА') {
	alert('ВПИРЬОД НА РАБОТКУ!!!!1');
}
*/

////////////////////////////////////////////////////////////////////////////
////////////////////////////// Седьмое задание /////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let name = prompt('Как Вас зовут?');
if (name) {
	alert(`Здравствуйте, ${name}!`);
}
*/

////////////////////////////////////////////////////////////////////////////
////////////////////////////// Восьмое задание /////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let type = prompt('Укажите тип конвертации:'),
	startMoney = parseFloat(prompt('Сумма, подлежащая конвертации:'));
const COEF = 25;

switch (type.toLowerCase()) {
	case 'uah-usd': alert(`${startMoney} uah = ${startMoney / COEF} usd`); break;
	case 'usd-uah': alert(`${startMoney} usd = ${startMoney * COEF} uah`); break;
	default: alert('Невалидный тип конвертации.');
}
*/

////////////////////////////////////////////////////////////////////////////
////////////////////////////// Девятое задание /////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let greeting,
	lang = prompt('Укажите значение lang:').toLowerCase();

if (lang === 'ru') {
	greeting = 'Добро пожаловать в мир Javascript!';
} else if (lang === 'en') {
	greeting = 'Wellcome to Hell!';
} else if (lang === 'de') {
	greeting = 'Willkommen in der Hölle!';
}

alert(greeting);

switch (lang) {
	case 'ru': greeting = 'Добро пожаловать в мир Javascript!'; break;
	case 'en': greeting = 'Wellcome to Hell!'; break;
	case 'de': greeting = 'Willkommen in der Hölle!'; break;
}

alert(greeting);
*/

////////////////////////////////////////////////////////////////////////////
////////////////////////////// Десятое задание /////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let month = new Date().getMonth(),
	season;

switch (month) {
	case 11:
	case 0: 
	case 1: season = 'зима'; break;
	case 2:
	case 3:
	case 4: season = 'весна'; break;
	case 5:
	case 6:
	case 7: season = 'лето'; break;
	case 8: 
	case 9: 
	case 10: season = 'осень'; break;
}

alert(`Сейчас ${season}.`);
*/

////////////////////////////////////////////////////////////////////////////
/////////////////////////// Одиннадцатое задание ///////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
let lang = prompt('Укажите значение lang:').toLowerCase(),
	day = parseInt(prompt('Укажите день:')),
	result;

switch (day) {
	case 0: if (lang === 'ru') {
				result = 'Понедельник';
			} else if (lang === 'en') {
				result = 'Monday';
			}; break;
	case 1: if (lang === 'ru') {
				result = 'Вторник';
			} else if (lang === 'en') {
				result = 'Tuesday';
			}; break;
	case 2: if (lang === 'ru') {
				result = 'Среда';
			} else if (lang === 'en') {
				result = 'Wednesday';
			}; break;
	case 3: if (lang === 'ru') {
				result = 'Четверг';
			} else if (lang === 'en') {
				result = 'Thursday';
			}; break;
	case 4: if (lang === 'ru') {
				result = 'Пятница';
			} else if (lang === 'en') {
				result = 'Friday';
			}; break;
	case 5: if (lang === 'ru') {
				result = 'Суббота';
			} else if (lang === 'en') {
				result = 'Saturday';
			}; break;
	case 6: if (lang === 'ru') {
				result = 'Воскресенье';
			} else if (lang === 'en') {
				result = 'Sunday';
			}; break;
}

alert(result);
*/

////////////////////////////////////////////////////////////////////////////
/////////////////////////// Двенадцатое задание ////////////////////////////
////////////////////////////////////////////////////////////////////////////
/*
var x = parseInt(prompt('x', 0));
var error = null;

if (isNaN(x)) {
	error = 'Не математическая операция';
} else {
	switch (x) {
	    case 0: error = 'На ноль делить нельзя'; break;
	    case 1: error = 'На единицу делить бессмысленно'; break;
	}
}

if (error) {
    alert(error);
} else {
    alert(100 / x);
}
*/